Tekla Open API Reference for Tekla Structures 2025
PrintAttributes Properties
The PrintAttributes type exposes the following members.
Properties
Name | Description
NumberOfCopies
 The number of copies in printing.
Orientation
 The print orientation type.
PrintArea
 The print area type.
PrinterInstance
 The name of the printer instance. Can be fetched from the printer catalog.
PrintToMultipleSheet
 Whether to print to multiple sheets.
Scale
 The scale factor.
ScalingType
 The scale type.
Top
See Also
Reference
PrintAttributes Class
Tekla.Structures.Drawing Namespace